Revit 2016 API
TextNode.Width Property
 Width [ft] of the area of the text content.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public double Width { get; }
Visual Basic
Public ReadOnly Property Width As Double
	Get
Visual C++
public:
property double Width {
	double get ();
}
Remarks
 The value represents units in the the model space.
See Also
TextNode Class
Autodesk.Revit.DB Namespace